app/controllers/v1/lessons_controller.rb

    def index
      @lessons = Lesson.order(created_at: :desc).all
---
SELECT "lessons".* FROM "lessons"  ORDER BY "lessons"."created_at" DESC

    def show
      @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 2]]

    def create
      @lesson = Lesson.new(lesson_params)

      if @lesson.save
---
INSERT INTO "lessons" ("title", "summary", "link", "creator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)