app/controllers/v1/users_controller.rb

    def create
      @user = User.new user_params

      if @user.save
---
INSERT INTO "users" ("email", "username", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)