app/controllers/comments_controller.rb

	def create
		comment = Comment.new(comments_params)
		if comment.save
---
INSERT INTO "comments" ("user_id", "question_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 11], ["question_id", 20], ["body", "test"], ["created_at", "2015-08-17 02:35:16.270949"], ["updated_at", "2015-08-17 02:35:16.270949"]]