app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons"  ORDER BY "lessons"."created_at" DESC
---
  def index
    @lessons = Lesson.order(created_at: :desc).all

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 19]]
---
  def show
    @lesson = Lesson.find(params[:id])

INSERT INTO "lessons" ("title", "summary", "link", "creator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @lesson = Lesson.new(lesson_params)

    if @lesson.save