app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC
---
  def index
    @questions = Question.all

INSERT INTO "questions" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My new Question"], ["body", "Yeah hi"], ["user_id", 11], ["created_at", "2015-08-12 02:31:47.735836"], ["updated_at", "2015-08-12 02:31:47.735836"]]
---
  def create
    @question = Question.new(question_params)

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 18]]
SELECT "comments".* FROM "comments" WHERE "comments"."question_id" = ?  [["question_id", 21]]
---
    def set_question
      @question = Question.includes(:comments).find(params[:id])